brew "wget"
brew "stow"
brew "git"
brew "openssh"

# For Yubikey management
brew "ykman"
brew "gnupg"
brew "pinentry-mac"
brew "libfido2"

# Zoxide for better jumping
brew "zoxide"

# Better fuzzy file picking
brew "fzf"

# Better LS
brew "eza"

# Recetangle window management
cask "rectangle"

# Development
cask "zed"
cask "warp"
brew "deno"
brew "nvm"
brew "awscli"
brew "rustup"
brew "trivy"
brew "just"
brew "pre-commit"
brew "sops"
brew "direnv"

# Work
cask "slack"
cask "zoom"
cask "linear-linear"

# Security
cask "pareto-security"
brew "wireguard-tools"
