# Core
brew "wget"                         # Fetch via HTTP
brew "stow"                         # Dotfile management
brew "git"                          # Git version control

# For Yubikey management
brew "ykman"                        # Yubikey manager
brew "gnupg"                        # GPG Encryption/Signing
brew "pinentry-mac"                 # Modals for entering pins for Yubikey
brew "libfido2"                     # FIDO2 support

# Terminal
cask "warp"                         # Terminal
brew "zoxide"                       # Jumping between folders based on history
brew "fzf"                          # Fuzzy file picking
brew "eza"                          # Alternative to ls/ll
brew "bat"                          # Alternative to cat with syntax highlighting
brew "jq"                           # Better JSON handling
brew "zsh-syntax-highlighting"      # ZSH highlighting

# Recetangle window management
cask "rectangle"                    # Tiling window management

# Development
cask "zed"                          # Editor
brew "deno"                         # Deno programming language
brew "nvm"                          # NodeJS programming language
brew "pnpm"                         # NodeJS package manager
brew "awscli"                       # AWS CLI
brew "rustup"                       # Rust programming language
brew "trivy"                        # Security scanning
brew "just"                         # Alternative to make
brew "pre-commit"                   # Run hooks before commit
brew "sops"                         # File encryption
brew "direnv"                       # Environment variables per dir
brew "git-delta"                    # Better pager for Git
brew "czg"                          # Commit management
cask "codex"                        # OpenAI Codex agentic development
cask "chatgpt"                      # OpenAI ChatGPT
cask "postman"                      # Postman API development
brew "docker"                       # Docker container runtime
brew "colima"                       # Alternative to docker desktop
cask "google-chrome"                # Chrome browser for extension devleopment
brew "foundry"                      # Ethereum application development
brew "gh"                           # GitHub CLI
cask "font-fira-code"               # Fira Programming Font

# Personal
cask "whatsapp"                     # Messaging
cask "spotify"                      # Music

# Tools
cask "balenaetcher"                 # Disk image writing

# Work tools
cask "slack"                        # Team chat
cask "zoom"                         # Team video conferencing
cask "linear-linear"                # Team project management
cask "notion"                       # Team documentation/Wikis
cask "1password"                    # Team passwords
cask "1password-cli"                # Team passwords CLI

# Security
cask "pareto-security"              # Security enforcement for MacOS
brew "wireguard-tools"              # VPN for connecting to remote networks
cask "proton-pass"                  # Password management
cask "tailscale-app"                # Tailscale Wireguard network
brew "openssh"                      # Better SSH than built-in MacOS version
